# Traiter les valeurs manquantes
## Trouver les valeurs manquantes
- Lire le dataset titanic_survival.csv
- Comparer le nombre de valeurs dans la colonne "age" possédant des valeurs manquantes
    - Assigner à la variable age la colonne des ages du dataframe titanic_survival
    - Utiliser pandas.isnull() sur la variable age pour créer une series de valeurs True et False
    - Ustiliser la series résultante pour sélectionner seulement les éléments de la colonne "age" qui sonts nuls et assigner le résultat à la variable age_null
    - Assigner le nombre de valeurs manquantes de age_null à la variable age_null_count (fonction len())
- Affihce rage_null_count pour voir le nombre de valeurs manquantes de la colonne "age"

In [1]:
import pandas as pd 

titanic_survival = pd.read_csv("jeux_de_donnees/titanic_survival.csv")
titanic_survival

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [2]:
age = titanic_survival["age"]
age_null = age[age.isnull()==True]
age_null_count = len(age_null)
print(age_null_count)

264

## Problème avec les valeurs manquantes
- Utiliser age_is_null pour créer un vecteur qui contient seulement les valeurs de la colonne "age" qui ne sont pas NaN
- Assigner ce résultta à la variable good_ages
- Calculer la moyenne de ce nouveau vecteur et sassigner le résultat à la variable mean_age
- Afficher cette moyenne

In [3]:
age_is_null = pd.isnull(titanic_survival["age"])
good_ages = titanic_survival["age"][age_is_null==False]

mean_age = good_ages.mean()

print(mean_age)

29.8811345124283

## Calculer la moyenne
- Assigner la moyenne de la colonne "fare" à la variable mean_fare

In [4]:
mean_fare = titanic_survival["fare"].mean()
print(mean_fare)

33.29547928134572

## Calculer des statistiques de prix
- Créer un dictionnaire vide qu'on nommera fares_by_class
- Créer la liste passenger_classes qui contient les éléments [1,2,3]
- Utiliser une boucle for pour parcourir la liste passenger_classes
    - Sélectionner juste les lignes de titanic_survival pour lesquelles la colone pclass est égale à la variable de temporaire de la boucle
    - Sélectionner seulement la colonne fare pour ce sous-sensemble de lignes (correspondant à la classe)
    - Ajouter cette moyenne calculée de la classe au disctionnaire fares_by_class avec comme clé le numéro de la classe et comme valeur la moyenne du prix du billet
- Une fois al boucle achevée, afficher le resultat

In [5]:
fares_by_class = {}
passengers_classes=[1.,2.,3.]

for i in passengers_classes:

    rows_class = titanic_survival[titanic_survival["pclass"]==i]
    fares_by_class[i] = rows_class["fare"].mean()
    
print(fares_by_class)

# Autres solution :

print({pclass: titanic_survival["fare"][titanic_survival["pclass"] == pclass].mean() for pclass in titanic_survival["pclass"].unique()})

titanic_survival[["fare", "pclass"]].groupby("pclass").mean()

{1.0: 87.50899164086687, 2.0: 21.1791963898917, 3.0: 13.302888700564957}
{1.0: 87.50899164086687, 2.0: 21.1791963898917, 3.0: 13.302888700564957, nan: nan}

             fare
pclass
1.0     87.508992
2.0     21.179196
3.0     13.302889

## Introduction aux pivots de table 

Le pivot de table est un moyen de créer un sous-ensemble directement sur une colonne et d'effectuer un calcul sur une colonne comme la somme ou une moyenne.

- Utiliser la méthode dataFrame.pivot-table() pour calculer la moyenne de l'âge pour chaque classe de passager ("pclass")
- Assigner le résultat à la variable passenger_age.
- Afficher passenger_age
- Faire de même avec la colonne survived pour chaque classe de passager

In [17]:
passenger_age = titanic_survival.pivot_table(index="pclass", values="age")
print(passenger_age,"\n")

passenger_fare = titanic_survival.pivot_table(index="pclass", values="fare")
print(type(passenger_fare))
passenger_fare


# Cette méthode utilise numpy donc si on veut la modifier il faudra importer numpy

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

<class 'pandas.core.frame.DataFrame'>

             fare
pclass
1.0     87.508992
2.0     21.179196
3.0     13.302889

In [19]:
passenger_survival = titanic_survival.pivot_table(index="pclass", values="survived")
passenger_survival

        survived
pclass
1.0     0.619195
2.0     0.429603
3.0     0.255289

## Pivot Table niveau 2

- Faire un pivot de table qui calcule le total d'argent encaissé ("fare") et le nombre total de survivant ("survived") pour chaque port d'embarcation "embarked"
- assigner le résultat à la variable port_stats
- Afficher le résultat

In [26]:
import numpy as np 

port_stats = titanic_survival.pivot_table(index="embarked", values=["fare","survived"], aggfunc=np.sum)
port_stats

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

## Eliminer les valeurs manquantes

- Supprimer toutes les lignes de titanic_survival pour lesquelles les colonnes "age" ou "sex" ont des valeurs manquantes et assigner le résultat à la variable new_titanic_survival.
- Comparer le nombre de lignes qu'il reste avec l'attribut shape.

In [27]:
#axis = 0 pour supprimer les lignes et axis=1 pour supprimer les colonnes
new_titanic_survival = titanic_survival.dropna(axis=0, subset=["age","sex"])
new_titanic_survival

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1301,3.0,0.0,"Youseff, Mr. Gerious",male,45.5000,0.0,0.0,2628,7.2250,NaN,C,NaN,312.0,NaN
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14.5000,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [29]:
print(titanic_survival.shape)
print(new_titanic_survival.shape)

(1310, 14)
(1046, 14)

## Pour accéder à des lignes : iloc

- Assigner les 10 premières lignes de new_titanic_survival à la variable first_ten_rows
- Assigner la 5ème ligne de new_titanic_survival à la variable row_position_fifth
- Assigner la ligne dont l'ititulé d'index est 25 pour new_titanic_survival à la variable row_index_25

In [31]:
first_ten_rows = new_titanic_survival.iloc[0:10]
row_position_fifth = new_titanic_survival.iloc[4]

row_index_25 = new_titanic_survival.loc[25] 

# iloc on donne l'index, le numéro de ligne ou le numéro de colonne (commence par 0)
# loc on donne l'intitulé iu l'étiquette de l'index

## Les index de colonne
- Assigner la valeur d'intitulé de ligne 1100 pour la colonne "age" de new_titanic_survival à la variable row_index_1100_age
- Assigner la valeur d'intitulé de ligne 25 pour la colonne "survived" de new_titanic_survival à la variable row_index_25_survived
- Assigner les 5 premières lignes et 3 premières colonnes de new_titanic_survival à la variable five_rows_three_cols
- Afficher tous les résultats

In [33]:
row_index_1100_age = new_titanic_survival.loc[1100,"age"]
row_index_25_survived = new_titanic_survival.loc[25,"survived"]
five_rows_three_cols = new_titanic_survival.iloc[0:5,0:3]

print(row_index_1100_age)
print(row_index_25_survived)
five_rows_three_cols

29.0
0.0

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

## Réindexer les lignes d'un dataframe

- Ré-indexer le dataframe new_titanic_survival pour que la première ligne commence à 0 et supprimer l'ancien indexage.
- Assigner le résultat à la variable titanic_reindexed.
- Afficher les 5 premières lignes et 3 premières colonnes de titanic_reindexed.

In [36]:
# Pour éliminer les sauts de ligne et avoir un bon indexage
titanic_reindexed = new_titanic_survival.reset_index(drop=True) # drop pour ne pas conserver l'ancien index sous forme d'une colonne de plus
titanic_reindexed.iloc[0:5,0:3]

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

## Appliquer des fonctions sur un DataFrame
- Ecrire une fonction qui compte le nombre d'éléments manquants d'un objet Series.
- Ustiliser la méthode DataFrame.apply() pour appliquer votre fonction sur titanic_survival
- Assigner le résultat à la variable column_null_count
- Afficher le résultat

In [37]:
def null_count(column):
    column_null = pd.isnull(column)
    null = column[column_null]
    return len(null)

In [42]:
column_null_count = titanic_survival.apply(null_count)
column_null_count2 = titanic_survival[["pclass","age"]].apply(null_count)
print(column_null_count,"\n")
print(column_null_count2)

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

pclass      1
age       264
dtype: int64

## Appliquer ybe finction à une ligne

- Créer une fonction qui retourne la chaine de caractères "minor" pour quelqu'un de moins de 18 ans, "adult" si son age est supérieur ou égal à 18 et "unknown" si la valeur est manquante.
- Utiliser cette fonction avec la méthode apply() pour trouver l'intitulé correct pour chaque passager du dataframe titanic_survival.  Ajouter l'option axis=1.
- Assigner le résultat à la variable age_labels.
- Afficher le résultat

In [90]:
def is_adult(ligne):

    age = ligne["age"]

    if pd.isnull(age) : return "unknown"
    elif age<18 : return "minor"
    else : return "adult"

age_labels = titanic_survival.apply(is_adult,axis=1)

age_labels

0         adult
1         minor
2         minor
3         adult
4         adult
         ...
1305    unknown
1306      adult
1307      adult
1308      adult
1309    unknown
Length: 1310, dtype: object

## Pratique : calculer le poucentage de survie par tranche d'âge

- Ajouter la colonne "age_labels" au dataframe titanic_survival contenant la variable age_labels qu'on a créé précédement.
- Créer une table pivot qui calcule la moyenne de chance de survie (colonne "survived") pour chaque groupe d'âge (colonne "age_labels") du dataframe titanic_survival.
- Assigner l'objet Series résultant à la variable age_group_survival.
- Afficher le résultat.

In [89]:
titanic_survival["age_labels"] = age_labels

age_group_survival = titanic_survival.pivot_table(index="age_labels", values=["survived"], aggfunc=np.mean)

age_group_survival

            survived
age_labels
adult       0.387892
minor       0.525974
unknown     0.277567